# add brew repos
# can untap homebrew/core and homebrew/cask since v4.0
tap "hashicorp/tap"

# general utilities
brew "gawk"
brew "golang"
brew "jnv"
brew "jq"
brew "nvm"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "ripgrep"

brew "hashicorp/tap/terraform"

cask "brave-browser"
cask "caffeine"
cask "docker-desktop"
cask "iterm2"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "syncthing-app"
